{
  "term": "Fall",
  "year": "2012",
  "level": [
    "Undergraduate"
  ],
  "topics": [
    [
      "Mathematics",
      "Calculus"
    ],
    [
      "Mathematics",
      "Mathematical Analysis"
    ]
  ],
  "legacy_uid": "35dc076a-ccd1-da75-d7a1-efb5780a70e1",
  "instructors": {
    "content": [
      "bc685657-74ac-1dda-c088-c754a415c138"
    ],
    "website": "ocw-www"
  },
  "course_image": {
    "content": "3b934aa7-b6d8-e92c-8433-75ee21b68644",
    "website": "18-100c-real-analysis-fall-2012"
  },
  "course_title": "Real Analysis",
  "course_description": "This course covers the fundamentals of mathematical analysis: convergence of sequences and series, continuity, differentiability, Riemann integral, sequences and series of functions, uniformity, and the interchange of limit operations. It shows the utility of abstract concepts and teaches an understanding and construction of proofs. MIT students may choose to take one of three versions of Real Analysis; this version offers three additional units of credit for instruction and practice in written and oral presentation.\n\nThe three options for 18.100:\n\n*   Option A (18.100A) chooses less abstract definitions and proofs, and gives applications where possible.\n*   Option B (18.100B) is more demanding and for students with more mathematical maturity; it places more emphasis from the beginning on point-set topology and n-space, whereas Option A is concerned primarily with analysis on the real line, saving for the last weeks work in 2-space (the plane) and its point-set topology.\n*   Option C (18.100C) is a 15-unit variant of Option B, with further instruction and practice in written and oral communication. This fulfills the MIT CI requirement.\n",
  "department_numbers": [
    "18"
  ],
  "extra_course_numbers": "",
  "primary_course_number": "18.100C",
  "course_image_thumbnail": {
    "content": "bdbfeb4c-fe36-a909-ad00-c967cd432940",
    "website": "18-100c-real-analysis-fall-2012"
  },
  "learning_resource_types": [],
  "site_uid": "1b4e42dc-42da-4eff-b211-06fe4000a591",
  "site_short_id": "18.100c-fall-2012",
  "site_url_path": "courses/18-100c-real-analysis-fall-2012",
  "title": "Course Metadata"
}